In [54]:
import pandas as pd
import numpy as np

In [3]:
#handling missing data in pandas

df = pd.DataFrame({'A':[1,2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
#dropping missing value in a row
#use 'dropna' method

df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
#removing missing value for column use 'axis = 1'

df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
# filling missing value
#use 'fillna' method 


df.fillna(value = 'SOMETHING')

           A          B  C
0          1          5  1
1          2  SOMETHING  2
2  SOMETHING  SOMETHING  3

In [8]:
#filling the missing value with a specific value eg the mean
#use 'fillna'and 'mean' method

In [9]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#grouping file

In [10]:
df = pd.DataFrame({'Gender':['M','M','F','F','F','M'],'Name':['John','Jack','Sarah','Olivia','Lily','Mehdi'],'Weight':[172,174,181,184,175,170]})

In [11]:
df

  Gender    Name  Weight
0      M    John     172
1      M    Jack     174
2      F   Sarah     181
3      F  Olivia     184
4      F    Lily     175
5      M   Mehdi     170

In [12]:
#we could also do grouping of files
#eg based on their mean,max,

In [13]:
df.groupby('Gender').max()

         Name  Weight
Gender
F       Sarah     184
M       Mehdi     174

In [14]:
df.groupby('Gender').min()

        Name  Weight
Gender
F       Lily     175
M       Jack     170

In [15]:
df.groupby('Gender').max()

         Name  Weight
Gender
F       Sarah     184
M       Mehdi     174

In [16]:
#describe method can be used to  tell describe data


df.groupby('Gender').describe()

       Weight
        count   mean       std    min    25%    50%    75%    max
Gender
F         3.0  180.0  4.582576  175.0  178.0  181.0  182.5  184.0
M         3.0  172.0  2.000000  170.0  171.0  172.0  173.0  174.0

In [17]:


df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [18]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [19]:

df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']}, index = [4,5,6,7])

In [20]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [21]:
#concating 2 dataframe
#use 'concat'

In [22]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [23]:
#concating using the row
#pass the axis = 1

In [24]:
pd.concat([df1,df2],axis = 1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [25]:
#merging two dataframe

df1 = pd.DataFrame({'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})

In [26]:
df2 = pd.DataFrame({'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'E':['D0','D1','D2','D3']})

In [27]:
df1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [28]:
df2

  key   C   E
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [29]:
#merging 2 dataframe 
#use 'merge method'

In [30]:
pd.merge(df1,df2, on = 'key', how='inner')

  key   A   B   C   E
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [31]:
#other pandas operation

In [32]:
df = pd.DataFrame({'C1':[5,9,11,12],'C2':[23,17,40,23],'C3':['A','B','C','D']})

In [33]:
df

   C1  C2 C3
0   5  23  A
1   9  17  B
2  11  40  C
3  12  23  D

In [34]:
#the 'head' function help us to determine 
#the number of rows we want to view first

df.head(2)

   C1  C2 C3
0   5  23  A
1   9  17  B

In [35]:
#to see the unique values in a column

In [36]:
df['C2'].unique()

array([23, 17, 40], dtype=int64)

In [37]:
df['C2'].unique()

array([23, 17, 40], dtype=int64)

In [38]:
#'nunique' returns the number of unique values


df['C2'].nunique()

3

In [39]:
#value_counts method helps to return the number of times a particular value occured


df['C2'].value_counts()

23    2
17    1
40    1
Name: C2, dtype: int64

In [40]:
#applying a function to dataframe
#first define the functiopn
#the use 'apply' to pass the defined function

In [41]:
def custom_function(x):
    return x**2

In [42]:
df

   C1  C2 C3
0   5  23  A
1   9  17  B
2  11  40  C
3  12  23  D

In [43]:
#applying the custom_function

df['C2'].apply(custom_function)

0     529
1     289
2    1600
3     529
Name: C2, dtype: int64

In [44]:
#we could also use the lambda function

In [45]:
df['C2'].apply(lambda x: x**2)

0     529
1     289
2    1600
3     529
Name: C2, dtype: int64

In [46]:
#sum function

df['C1'].sum()

37

In [47]:
#we can also sort value in a dataframe
#use sort_values method

In [48]:
df.sort_values(by = ['C1'])

   C1  C2 C3
0   5  23  A
1   9  17  B
2  11  40  C
3  12  23  D

In [58]:
exam_data = {'name':['Anastasia','Dima','Katherine','james','Emily','Micheal','Matthew',
                    'Laura','Kelvin','Jonas'],
            'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
            'attempts':[1,3,2,3,2,3,1,1,2,1],
            'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}

In [59]:
dframe = DataFrame(exam_data)

In [60]:
dframe

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      james    NaN         3      no
4      Emily    9.0         2      no
5    Micheal   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8     Kelvin    8.0         2      no
9      Jonas   19.0         1     yes

In [57]:
from pandas import DataFrame, Series

In [63]:
dframe.groupby('score').max()

            name  attempts qualify
score
8.0       Kelvin         2      no
9.0        Emily         3      no
12.5   Anastasia         1     yes
14.5     Matthew         1     yes
16.5   Katherine         2     yes
19.0       Jonas         1     yes
20.0     Micheal         3     yes